#+STARTUP: overview
#+TITLE: nur-packages
#+AUTHOR: natsukium

My personal [[https://github.com/nix-community/NUR][NUR]] repository

[[Build and populate cache][https://github.com/natsukium/nur-packages/actions/workflows/build.yml/badge.svg]]

[[https://natsukium.cachix.org][https://img.shields.io/badge/cachix-natsukium-blue.svg]]

** Packages

#+begin_src shell :results output table :exports results
echo Package, Description, Homepage, Platforms, License
nix eval --raw .#packages.x86_64-linux \
    --apply 'ps:
builtins.concatStringsSep "\n" (
  builtins.map
    (
      p:
      "${ps.${p}.meta.name}, ${ps.${p}.meta.description}, ${ps.${p}.meta.homepage}, ${
        builtins.concatStringsSep " / " (
          builtins.filter (
            x: x == "x86_64-linux" || x == "aarch64-linux" || x == "x86_64-darwin" || x == "aarch64-darwin"
          ) ps.${p}.meta.platforms
        )
      }, ${ps.${p}.meta.license.shortName}"
    )
    (
      builtins.filter (x: !(x == "lib" || x == "modules" || x == "overlays" || x == "vimPlugins" || x == "my-firefox-addons")) (
        builtins.attrNames ps
      )
    )
)'
#+end_src

#+RESULTS:
| Package                              | Description                                                                                                                | Homepage                                                                         | Platforms                                                     | License  |
| CopyQ-10.0.0                         | Clipboard Manager with Advanced Features                                                                                   | https://hluk.github.io/CopyQ                                                     | aarch64-linux / x86_64-linux / aarch64-darwin                 | gpl3Plus |
| emacs-plus-30.2                      | A wide range of extra functionality over regular Emacs for macOS                                                           | https://github.com/d12frosted/homebrew-emacs-plus                                | x86_64-darwin / aarch64-darwin                                | gpl3Plus |
| google-japanese-input-2.30.5590.1    | Japanese Input Method Editor                                                                                               | https://www.google.co.jp/ime                                                     | x86_64-darwin / aarch64-darwin                                | unfree   |
| hammerspoon-1.0.0                    | Staggeringly powerful macOS desktop automation with Lua                                                                    | https://github.com/Hammerspoon/hammerspoon                                       | x86_64-darwin / aarch64-darwin                                | mit      |
| liga-hackgen-font-0.1.0              | Ligaturized hackgen with fira code                                                                                         | https://github.com/natsukium/nur-packages/tree/main/pkgs/data/fonts/liga-hackgen | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | ofl      |
| liga-hackgen-nf-font-0.1.0           | Ligaturized hackgen-nf with fira code                                                                                      | https://github.com/natsukium/nur-packages/tree/main/pkgs/data/fonts/liga-hackgen | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | ofl      |
| ligaturizer-5                        | A tool for adding ligatures to any coding font                                                                             | https://github.com/ToxicFrog/Ligaturizer                                         | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | gpl3     |
| nixpkgs-review-3.5.0-fork-2025-01-10 | Patched version of nixpkgs-review with additional features                                                                 | https://github.com/natsukium/nixpkgs-review                                      | aarch64-linux / x86_64-linux / x86_64-darwin / aarch64-darwin | mit      |
| paperwm-spoon-0-unstable-2025-09-26  | Tiled scrollable window manager for MacOS                                                                                  | https://github.com/mogenson/PaperWM.spoon                                        | x86_64-darwin / aarch64-darwin                                | mit      |
| psipred-4.0                          | Protein Secondary Structure Predictor                                                                                      | http://bioinf.cs.ucl.ac.uk/psipred                                               | aarch64-linux / x86_64-linux                                  | boost    |
| qmk-toolbox-0.3.3                    | A Toolbox companion for QMK Firmware                                                                                       | https://github.com/qmk/qmk_toolbox                                               | x86_64-darwin / aarch64-darwin                                | mit      |
| qutebrowser-3.5.1                    | Keyboard-focused browser with a minimal GUI                                                                                | https://github.com/qutebrowser/qutebrowser                                       | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | gpl3Plus |
| sbarlua-unstable-2024-08-12          | A Lua API for SketchyBar                                                                                                   | https://github.com/FelixKratz/SbarLua                                            | x86_64-darwin / aarch64-darwin                                | gpl3Only |
| vivaldi-7.5.3735.74                  | A Browser for our Friends powerful and personal                                                                            | https://vivaldi.com                                                              | x86_64-linux / aarch64-linux / x86_64-darwin / aarch64-darwin | unfree   |
| zen-browser-1.16.2b                  | Privacy-focused browser that blocks trackers; ads; and other unwanted content while offering the best browsing experience! | https://github.com/zen-browser/desktop                                           | aarch64-darwin                                                | mpl20    |
